Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0128gpm028.h
extern volatile __CCP4CON1bits_t CCP4CON1bits __asm__ ("CCP4CON1") __attribute__((section("sfrs"), address(0xBF800400)));
extern volatile uint32_t        CCP4CON1CLR __attribute__((section("sfrs"),address(0xBF800404)));
extern volatile uint32_t        CCP4CON1SET __attribute__((section("sfrs"),address(0xBF800408)));
extern volatile uint32_t        CCP4CON1INV __attribute__((section("sfrs"),address(0xBF80040C)));
#define CCP4CON2 CCP4CON2
extern volatile uint32_t   CCP4CON2 __attribute__((section("sfrs"), address(0xBF800410)));
typedef struct {
  uint32_t ASDG:8;
  uint32_t :4;
  uint32_t SSDG:1;
  uint32_t :1;
  uint32_t ASDGM:1;
  uint32_t PWMRSEN:1;
  uint32_t ICS:3;
  uint32_t AUXOUT:2;
  uint32_t :1;
  uint32_t ICGSM:2;
  uint32_t OCAEN:1;
  uint32_t :6;
  uint32_t OENSYNC:1;
} __CCP4CON2bits_t;
extern volatile __CCP4CON2bits_t CCP4CON2bits __asm__ ("CCP4CON2") __attribute__((section("sfrs"), address(0xBF800410)));
extern volatile uint32_t        CCP4CON2CLR __attribute__((section("sfrs"),address(0xBF800414)));
extern volatile uint32_t        CCP4CON2SET __attribute__((section("sfrs"),address(0xBF800418)));
extern volatile uint32_t        CCP4CON2INV __attribute__((section("sfrs"),address(0xBF80041C)));
#define CCP4CON3 CCP4CON3
extern volatile uint32_t   CCP4CON3 __attribute__((section("sfrs"), address(0xBF800420)));
typedef struct {
  uint32_t :18;
  uint32_t PSSACE:2;
  uint32_t :1;
  uint32_t POLACE:1;
  uint32_t :6;
  uint32_t OSCNT:3;
  uint32_t OETRIG:1;
} __CCP4CON3bits_t;
extern volatile __CCP4CON3bits_t CCP4CON3bits __asm__ ("CCP4CON3") __attribute__((section("sfrs"), address(0xBF800420)));
extern volatile uint32_t        CCP4CON3CLR __attribute__((section("sfrs"),address(0xBF800424)));
extern volatile uint32_t        CCP4CON3SET __attribute__((section("sfrs"),address(0xBF800428)));
extern volatile uint32_t        CCP4CON3INV __attribute__((section("sfrs"),address(0xBF80042C)));
#define CCP4STAT CCP4STAT
extern volatile uint32_t   CCP4STAT __attribute__((section("sfrs"), address(0xBF800430)));
typedef struct {
  uint32_t ICBNE:1;
  uint32_t ICOV:1;
  uint32_t ICDIS:1;
  uint32_t SCEVT:1;
  uint32_t ASEVT:1;
  uint32_t TRCLR:1;
  uint32_t TRSET:1;
  uint32_t CCPTRIG:1;
  uint32_t :2;
  uint32_t ICGARM:1;
  uint32_t :5;
  uint32_t RAWIP:1;
  uint32_t RBWIP:1;
  uint32_t TMRLWIP:1;
  uint32_t TMRHWIP:1;
  uint32_t PRLWIP:1;
} __CCP4STATbits_t;
extern volatile __CCP4STATbits_t CCP4STATbits __asm__ ("CCP4STAT") __attribute__((section("sfrs"), address(0xBF800430)));
extern volatile uint32_t        CCP4STATCLR __attribute__((section("sfrs"),address(0xBF800434)));
extern volatile uint32_t        CCP4STATSET __attribute__((section("sfrs"),address(0xBF800438)));
extern volatile uint32_t        CCP4STATINV __attribute__((section("sfrs"),address(0xBF80043C)));
#define CCP4TMR CCP4TMR
extern volatile uint32_t   CCP4TMR __attribute__((section("sfrs"), address(0xBF800440)));
typedef union {
  struct {
    uint32_t TMRL:16;
    uint32_t TMRH:16;
  };
  struct {
    uint32_t TMR:32;
  };
} __CCP4TMRbits_t;
extern volatile __CCP4TMRbits_t CCP4TMRbits __asm__ ("CCP4TMR") __attribute__((section("sfrs"), address(0xBF800440)));
extern volatile uint32_t        CCP4TMRCLR __attribute__((section("sfrs"),address(0xBF800444)));
extern volatile uint32_t        CCP4TMRSET __attribute__((section("sfrs"),address(0xBF800448)));
extern volatile uint32_t        CCP4TMRINV __attribute__((section("sfrs"),address(0xBF80044C)));
#define CCP4PR CCP4PR
extern volatile uint32_t   CCP4PR __attribute__((section("sfrs"), address(0xBF800450)));
typedef union {
  struct {
    uint32_t PRL:16;
    uint32_t PRH:16;
  };
  struct {
    uint32_t PR:32;
  };
} __CCP4PRbits_t;
extern volatile __CCP4PRbits_t CCP4PRbits __asm__ ("CCP4PR") __attribute__((section("sfrs"), address(0xBF800450)));
extern volatile uint32_t        CCP4PRCLR __attribute__((section("sfrs"),address(0xBF800454)));
extern volatile uint32_t        CCP4PRSET __attribute__((section("sfrs"),address(0xBF800458)));
extern volatile uint32_t        CCP4PRINV __attribute__((section("sfrs"),address(0xBF80045C)));
#define CCP4RA CCP4RA
extern volatile uint32_t   CCP4RA __attribute__((section("sfrs"), address(0xBF800460)));
typedef struct {
  uint32_t CMPA:16;
} __CCP4RAbits_t;
extern volatile __CCP4RAbits_t CCP4RAbits __asm__ ("CCP4RA") __attribute__((section("sfrs"), address(0xBF800460)));
extern volatile uint32_t        CCP4RACLR __attribute__((section("sfrs"),address(0xBF800464)));
extern volatile uint32_t        CCP4RASET __attribute__((section("sfrs"),address(0xBF800468)));
extern volatile uint32_t        CCP4RAINV __attribute__((section("sfrs"),address(0xBF80046C)));
#define CCP4RB CCP4RB
extern volatile uint32_t   CCP4RB __attribute__((section("sfrs"), address(0xBF800470)));
typedef struct {
  uint32_t CMPB:16;
} __CCP4RBbits_t;
extern volatile __CCP4RBbits_t CCP4RBbits __asm__ ("CCP4RB") __attribute__((section("sfrs"), address(0xBF800470)));
extern volatile uint32_t        CCP4RBCLR __attribute__((section("sfrs"),address(0xBF800474)));
extern volatile uint32_t        CCP4RBSET __attribute__((section("sfrs"),address(0xBF800478)));
extern volatile uint32_t        CCP4RBINV __attribute__((section("sfrs"),address(0xBF80047C)));
#define CCP4BUF CCP4BUF
extern volatile uint32_t   CCP4BUF __attribute__((section("sfrs"), address(0xBF800480)));
typedef union {
  struct {
    uint32_t BUFL:16;
    uint32_t BUFH:16;
  };
  struct {
    uint32_t BUF:32;
  };
} __CCP4BUFbits_t;
extern volatile __CCP4BUFbits_t CCP4BUFbits __asm__ ("CCP4BUF") __attribute__((section("sfrs"), address(0xBF800480)));
extern volatile uint32_t        CCP4BUFCLR __attribute__((section("sfrs"),address(0xBF800484)));
extern volatile uint32_t        CCP4BUFSET __attribute__((section("sfrs"),address(0xBF800488)));
extern volatile uint32_t        CCP4BUFINV __attribute__((section("sfrs"),address(0xBF80048C)));
#define CCP5CON1 CCP5CON1
extern volatile uint32_t   CCP5CON1 __attribute__((section("sfrs"), address(0xBF800500)));
typedef struct {
  uint32_t MOD:4;
  uint32_t CCSEL:1;
  uint32_t T32:1;
  uint32_t TMRPS:2;
  uint32_t CLKSEL:3;
  uint32_t TMRSYNC:1;
  uint32_t CCPSLP:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t SYNC:5;
  uint32_t ALTSYNC:1;
  uint32_t ONESHOT:1;
  uint32_t TRIGEN:1;
  uint32_t OPS:4;
  uint32_t :2;
  uint32_t RTRGEN:1;
  uint32_t OPSSRC:1;
} __CCP5CON1bits_t;
