Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0128gpm028.h
extern volatile __CLC1CONbits_t CLC1CONbits __asm__ ("CLC1CON") __attribute__((section("sfrs"), address(0xBF802480)));
extern volatile uint32_t        CLC1CONCLR __attribute__((section("sfrs"),address(0xBF802484)));
extern volatile uint32_t        CLC1CONSET __attribute__((section("sfrs"),address(0xBF802488)));
extern volatile uint32_t        CLC1CONINV __attribute__((section("sfrs"),address(0xBF80248C)));
#define CLC1SEL CLC1SEL
extern volatile uint32_t   CLC1SEL __attribute__((section("sfrs"), address(0xBF802490)));
typedef struct {
  uint32_t DS1:3;
  uint32_t :1;
  uint32_t DS2:3;
  uint32_t :1;
  uint32_t DS3:3;
  uint32_t :1;
  uint32_t DS4:3;
} __CLC1SELbits_t;
extern volatile __CLC1SELbits_t CLC1SELbits __asm__ ("CLC1SEL") __attribute__((section("sfrs"), address(0xBF802490)));
extern volatile uint32_t        CLC1SELCLR __attribute__((section("sfrs"),address(0xBF802494)));
extern volatile uint32_t        CLC1SELSET __attribute__((section("sfrs"),address(0xBF802498)));
extern volatile uint32_t        CLC1SELINV __attribute__((section("sfrs"),address(0xBF80249C)));
#define CLC1GLS CLC1GLS
extern volatile uint32_t   CLC1GLS __attribute__((section("sfrs"), address(0xBF8024A0)));
typedef struct {
  uint32_t G1D1N:1;
  uint32_t G1D1T:1;
  uint32_t G1D2N:1;
  uint32_t G1D2T:1;
  uint32_t G1D3N:1;
  uint32_t G1D3T:1;
  uint32_t G1D4N:1;
  uint32_t G1D4T:1;
  uint32_t G2D1N:1;
  uint32_t G2D1T:1;
  uint32_t G2D2N:1;
  uint32_t G2D2T:1;
  uint32_t G2D3N:1;
  uint32_t G2D3T:1;
  uint32_t G2D4N:1;
  uint32_t G2D4T:1;
  uint32_t G3D1N:1;
  uint32_t G3D1T:1;
  uint32_t G3D2N:1;
  uint32_t G3D2T:1;
  uint32_t G3D3N:1;
  uint32_t G3D3T:1;
  uint32_t G3D4N:1;
  uint32_t G3D4T:1;
  uint32_t G4D1N:1;
  uint32_t G4D1T:1;
  uint32_t G4D2N:1;
  uint32_t G4D2T:1;
  uint32_t G4D3N:1;
  uint32_t G4D3T:1;
  uint32_t G4D4N:1;
  uint32_t G4D4T:1;
} __CLC1GLSbits_t;
extern volatile __CLC1GLSbits_t CLC1GLSbits __asm__ ("CLC1GLS") __attribute__((section("sfrs"), address(0xBF8024A0)));
extern volatile uint32_t        CLC1GLSCLR __attribute__((section("sfrs"),address(0xBF8024A4)));
extern volatile uint32_t        CLC1GLSSET __attribute__((section("sfrs"),address(0xBF8024A8)));
extern volatile uint32_t        CLC1GLSINV __attribute__((section("sfrs"),address(0xBF8024AC)));
#define CLC2CON CLC2CON
extern volatile uint32_t   CLC2CON __attribute__((section("sfrs"), address(0xBF802500)));
typedef struct {
  uint32_t MODE:3;
  uint32_t :2;
  uint32_t LCPOL:1;
  uint32_t LCOUT:1;
  uint32_t LCOE:1;
  uint32_t :2;
  uint32_t INTN:1;
  uint32_t INTP:1;
  uint32_t :3;
  uint32_t ON:1;
  uint32_t G1POL:1;
  uint32_t G2POL:1;
  uint32_t G3POL:1;
  uint32_t G4POL:1;
} __CLC2CONbits_t;
extern volatile __CLC2CONbits_t CLC2CONbits __asm__ ("CLC2CON") __attribute__((section("sfrs"), address(0xBF802500)));
extern volatile uint32_t        CLC2CONCLR __attribute__((section("sfrs"),address(0xBF802504)));
extern volatile uint32_t        CLC2CONSET __attribute__((section("sfrs"),address(0xBF802508)));
extern volatile uint32_t        CLC2CONINV __attribute__((section("sfrs"),address(0xBF80250C)));
#define CLC2SEL CLC2SEL
extern volatile uint32_t   CLC2SEL __attribute__((section("sfrs"), address(0xBF802510)));
typedef struct {
  uint32_t DS1:3;
  uint32_t :1;
  uint32_t DS2:3;
  uint32_t :1;
  uint32_t DS3:3;
  uint32_t :1;
  uint32_t DS4:3;
} __CLC2SELbits_t;
extern volatile __CLC2SELbits_t CLC2SELbits __asm__ ("CLC2SEL") __attribute__((section("sfrs"), address(0xBF802510)));
extern volatile uint32_t        CLC2SELCLR __attribute__((section("sfrs"),address(0xBF802514)));
extern volatile uint32_t        CLC2SELSET __attribute__((section("sfrs"),address(0xBF802518)));
extern volatile uint32_t        CLC2SELINV __attribute__((section("sfrs"),address(0xBF80251C)));
#define CLC2GLS CLC2GLS
extern volatile uint32_t   CLC2GLS __attribute__((section("sfrs"), address(0xBF802520)));
typedef struct {
  uint32_t G1D1N:1;
  uint32_t G1D1T:1;
  uint32_t G1D2N:1;
  uint32_t G1D2T:1;
  uint32_t G1D3N:1;
  uint32_t G1D3T:1;
  uint32_t G1D4N:1;
  uint32_t G1D4T:1;
  uint32_t G2D1N:1;
  uint32_t G2D1T:1;
  uint32_t G2D2N:1;
  uint32_t G2D2T:1;
  uint32_t G2D3N:1;
  uint32_t G2D3T:1;
  uint32_t G2D4N:1;
  uint32_t G2D4T:1;
  uint32_t G3D1N:1;
  uint32_t G3D1T:1;
  uint32_t G3D2N:1;
  uint32_t G3D2T:1;
  uint32_t G3D3N:1;
  uint32_t G3D3T:1;
  uint32_t G3D4N:1;
  uint32_t G3D4T:1;
  uint32_t G4D1N:1;
  uint32_t G4D1T:1;
  uint32_t G4D2N:1;
  uint32_t G4D2T:1;
  uint32_t G4D3N:1;
  uint32_t G4D3T:1;
  uint32_t G4D4N:1;
  uint32_t G4D4T:1;
} __CLC2GLSbits_t;
extern volatile __CLC2GLSbits_t CLC2GLSbits __asm__ ("CLC2GLS") __attribute__((section("sfrs"), address(0xBF802520)));
extern volatile uint32_t        CLC2GLSCLR __attribute__((section("sfrs"),address(0xBF802524)));
extern volatile uint32_t        CLC2GLSSET __attribute__((section("sfrs"),address(0xBF802528)));
extern volatile uint32_t        CLC2GLSINV __attribute__((section("sfrs"),address(0xBF80252C)));
#define CLC3CON CLC3CON
extern volatile uint32_t   CLC3CON __attribute__((section("sfrs"), address(0xBF802580)));
typedef struct {
  uint32_t MODE:3;
  uint32_t :2;
  uint32_t LCPOL:1;
  uint32_t LCOUT:1;
  uint32_t LCOE:1;
  uint32_t :2;
  uint32_t INTN:1;
  uint32_t INTP:1;
  uint32_t :3;
  uint32_t ON:1;
  uint32_t G1POL:1;
  uint32_t G2POL:1;
  uint32_t G3POL:1;
  uint32_t G4POL:1;
} __CLC3CONbits_t;
extern volatile __CLC3CONbits_t CLC3CONbits __asm__ ("CLC3CON") __attribute__((section("sfrs"), address(0xBF802580)));
extern volatile uint32_t        CLC3CONCLR __attribute__((section("sfrs"),address(0xBF802584)));
extern volatile uint32_t        CLC3CONSET __attribute__((section("sfrs"),address(0xBF802588)));
extern volatile uint32_t        CLC3CONINV __attribute__((section("sfrs"),address(0xBF80258C)));
#define CLC3SEL CLC3SEL
extern volatile uint32_t   CLC3SEL __attribute__((section("sfrs"), address(0xBF802590)));
typedef struct {
  uint32_t DS1:3;
  uint32_t :1;
  uint32_t DS2:3;
  uint32_t :1;
  uint32_t DS3:3;
  uint32_t :1;
  uint32_t DS4:3;
} __CLC3SELbits_t;
extern volatile __CLC3SELbits_t CLC3SELbits __asm__ ("CLC3SEL") __attribute__((section("sfrs"), address(0xBF802590)));
extern volatile uint32_t        CLC3SELCLR __attribute__((section("sfrs"),address(0xBF802594)));
extern volatile uint32_t        CLC3SELSET __attribute__((section("sfrs"),address(0xBF802598)));
extern volatile uint32_t        CLC3SELINV __attribute__((section("sfrs"),address(0xBF80259C)));
#define CLC3GLS CLC3GLS
extern volatile uint32_t   CLC3GLS __attribute__((section("sfrs"), address(0xBF8025A0)));
typedef struct {
  uint32_t G1D1N:1;
  uint32_t G1D1T:1;
  uint32_t G1D2N:1;
  uint32_t G1D2T:1;
  uint32_t G1D3N:1;
  uint32_t G1D3T:1;
  uint32_t G1D4N:1;
  uint32_t G1D4T:1;
  uint32_t G2D1N:1;
  uint32_t G2D1T:1;
  uint32_t G2D2N:1;
  uint32_t G2D2T:1;
  uint32_t G2D3N:1;
  uint32_t G2D3T:1;
  uint32_t G2D4N:1;
  uint32_t G2D4T:1;
  uint32_t G3D1N:1;
  uint32_t G3D1T:1;
  uint32_t G3D2N:1;
  uint32_t G3D2T:1;
  uint32_t G3D3N:1;
  uint32_t G3D3T:1;
  uint32_t G3D4N:1;
  uint32_t G3D4T:1;
  uint32_t G4D1N:1;
  uint32_t G4D1T:1;
  uint32_t G4D2N:1;
  uint32_t G4D2T:1;
  uint32_t G4D3N:1;
  uint32_t G4D3T:1;
  uint32_t G4D4N:1;
  uint32_t G4D4T:1;
} __CLC3GLSbits_t;
extern volatile __CLC3GLSbits_t CLC3GLSbits __asm__ ("CLC3GLS") __attribute__((section("sfrs"), address(0xBF8025A0)));
extern volatile uint32_t        CLC3GLSCLR __attribute__((section("sfrs"),address(0xBF8025A4)));
extern volatile uint32_t        CLC3GLSSET __attribute__((section("sfrs"),address(0xBF8025A8)));
extern volatile uint32_t        CLC3GLSINV __attribute__((section("sfrs"),address(0xBF8025AC)));
#define CLC4CON CLC4CON
extern volatile uint32_t   CLC4CON __attribute__((section("sfrs"), address(0xBF802600)));
typedef struct {
  uint32_t MODE:3;
  uint32_t :2;
  uint32_t LCPOL:1;
  uint32_t LCOUT:1;
  uint32_t LCOE:1;
  uint32_t :2;
  uint32_t INTN:1;
  uint32_t INTP:1;
  uint32_t :3;
  uint32_t ON:1;
  uint32_t G1POL:1;
  uint32_t G2POL:1;
  uint32_t G3POL:1;
  uint32_t G4POL:1;
} __CLC4CONbits_t;
