Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0128gpm028.h
extern volatile __CNPUCbits_t CNPUCbits __asm__ ("CNPUC") __attribute__((section("sfrs"), address(0xBF802E00)));
extern volatile uint32_t        CNPUCCLR __attribute__((section("sfrs"),address(0xBF802E04)));
extern volatile uint32_t        CNPUCSET __attribute__((section("sfrs"),address(0xBF802E08)));
extern volatile uint32_t        CNPUCINV __attribute__((section("sfrs"),address(0xBF802E0C)));
#define CNPDC CNPDC
extern volatile uint32_t   CNPDC __attribute__((section("sfrs"), address(0xBF802E10)));
typedef union {
  struct {
    uint32_t :9;
    uint32_t CNPDC9:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDCbits_t;
extern volatile __CNPDCbits_t CNPDCbits __asm__ ("CNPDC") __attribute__((section("sfrs"), address(0xBF802E10)));
extern volatile uint32_t        CNPDCCLR __attribute__((section("sfrs"),address(0xBF802E14)));
extern volatile uint32_t        CNPDCSET __attribute__((section("sfrs"),address(0xBF802E18)));
extern volatile uint32_t        CNPDCINV __attribute__((section("sfrs"),address(0xBF802E1C)));
#define CNCONC CNCONC
extern volatile uint32_t   CNCONC __attribute__((section("sfrs"), address(0xBF802E20)));
typedef union {
  struct {
    uint32_t :10;
    uint32_t PORT32:1;
    uint32_t CNSTYLE:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONCbits_t;
extern volatile __CNCONCbits_t CNCONCbits __asm__ ("CNCONC") __attribute__((section("sfrs"), address(0xBF802E20)));
extern volatile uint32_t        CNCONCCLR __attribute__((section("sfrs"),address(0xBF802E24)));
extern volatile uint32_t        CNCONCSET __attribute__((section("sfrs"),address(0xBF802E28)));
extern volatile uint32_t        CNCONCINV __attribute__((section("sfrs"),address(0xBF802E2C)));
#define CNEN0C CNEN0C
extern volatile uint32_t   CNEN0C __attribute__((section("sfrs"), address(0xBF802E30)));
typedef union {
  struct {
    uint32_t :9;
    uint32_t CNIE0C9:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNEN0Cbits_t;
extern volatile __CNEN0Cbits_t CNEN0Cbits __asm__ ("CNEN0C") __attribute__((section("sfrs"), address(0xBF802E30)));
extern volatile uint32_t        CNEN0CCLR __attribute__((section("sfrs"),address(0xBF802E34)));
extern volatile uint32_t        CNEN0CSET __attribute__((section("sfrs"),address(0xBF802E38)));
extern volatile uint32_t        CNEN0CINV __attribute__((section("sfrs"),address(0xBF802E3C)));
#define CNSTATC CNSTATC
extern volatile uint32_t   CNSTATC __attribute__((section("sfrs"), address(0xBF802E40)));
typedef union {
  struct {
    uint32_t :9;
    uint32_t CNSTATC9:1;
    uint32_t CNSTATC10:1;
    uint32_t CNSTATC11:1;
    uint32_t CNSTATC12:1;
    uint32_t CNSTATC13:1;
    uint32_t CNSTATC14:1;
    uint32_t CNSTATC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATCbits_t;
extern volatile __CNSTATCbits_t CNSTATCbits __asm__ ("CNSTATC") __attribute__((section("sfrs"), address(0xBF802E40)));
extern volatile uint32_t        CNSTATCCLR __attribute__((section("sfrs"),address(0xBF802E44)));
extern volatile uint32_t        CNSTATCSET __attribute__((section("sfrs"),address(0xBF802E48)));
extern volatile uint32_t        CNSTATCINV __attribute__((section("sfrs"),address(0xBF802E4C)));
#define CNEN1C CNEN1C
extern volatile uint32_t   CNEN1C __attribute__((section("sfrs"), address(0xBF802E50)));
typedef union {
  struct {
    uint32_t :9;
    uint32_t CNIE1C9:1;
    uint32_t CNIE1C10:1;
    uint32_t CNIE1C11:1;
    uint32_t CNIE1C12:1;
    uint32_t CNIE1C13:1;
    uint32_t CNIE1C14:1;
    uint32_t CNIE1C15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNEN1Cbits_t;
extern volatile __CNEN1Cbits_t CNEN1Cbits __asm__ ("CNEN1C") __attribute__((section("sfrs"), address(0xBF802E50)));
extern volatile uint32_t        CNEN1CCLR __attribute__((section("sfrs"),address(0xBF802E54)));
extern volatile uint32_t        CNEN1CSET __attribute__((section("sfrs"),address(0xBF802E58)));
extern volatile uint32_t        CNEN1CINV __attribute__((section("sfrs"),address(0xBF802E5C)));
#define CNFC CNFC
extern volatile uint32_t   CNFC __attribute__((section("sfrs"), address(0xBF802E60)));
typedef union {
  struct {
    uint32_t :9;
    uint32_t CNFC9:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNFCbits_t;
extern volatile __CNFCbits_t CNFCbits __asm__ ("CNFC") __attribute__((section("sfrs"), address(0xBF802E60)));
extern volatile uint32_t        CNFCCLR __attribute__((section("sfrs"),address(0xBF802E64)));
extern volatile uint32_t        CNFCSET __attribute__((section("sfrs"),address(0xBF802E68)));
extern volatile uint32_t        CNFCINV __attribute__((section("sfrs"),address(0xBF802E6C)));
#define SR0C SR0C
extern volatile uint32_t   SR0C __attribute__((section("sfrs"), address(0xBF802E70)));
typedef struct {
  uint32_t w:32;
} __SR0Cbits_t;
extern volatile __SR0Cbits_t SR0Cbits __asm__ ("SR0C") __attribute__((section("sfrs"), address(0xBF802E70)));
extern volatile uint32_t        SR0CCLR __attribute__((section("sfrs"),address(0xBF802E74)));
extern volatile uint32_t        SR0CSET __attribute__((section("sfrs"),address(0xBF802E78)));
extern volatile uint32_t        SR0CINV __attribute__((section("sfrs"),address(0xBF802E7C)));
#define SR1C SR1C
extern volatile uint32_t   SR1C __attribute__((section("sfrs"), address(0xBF802E80)));
typedef struct {
  uint32_t w:32;
} __SR1Cbits_t;
extern volatile __SR1Cbits_t SR1Cbits __asm__ ("SR1C") __attribute__((section("sfrs"), address(0xBF802E80)));
extern volatile uint32_t        SR1CCLR __attribute__((section("sfrs"),address(0xBF802E84)));
extern volatile uint32_t        SR1CSET __attribute__((section("sfrs"),address(0xBF802E88)));
extern volatile uint32_t        SR1CINV __attribute__((section("sfrs"),address(0xBF802E8C)));
#define PMDCON PMDCON
extern volatile uint32_t   PMDCON __attribute__((section("sfrs"), address(0xBF8035B0)));
typedef struct {
  uint32_t :11;
  uint32_t PMDLOCK:1;
} __PMDCONbits_t;
extern volatile __PMDCONbits_t PMDCONbits __asm__ ("PMDCON") __attribute__((section("sfrs"), address(0xBF8035B0)));
extern volatile uint32_t        PMDCONCLR __attribute__((section("sfrs"),address(0xBF8035B4)));
extern volatile uint32_t        PMDCONSET __attribute__((section("sfrs"),address(0xBF8035B8)));
extern volatile uint32_t        PMDCONINV __attribute__((section("sfrs"),address(0xBF8035BC)));
#define PMD1 PMD1
extern volatile uint32_t   PMD1 __attribute__((section("sfrs"), address(0xBF8035C0)));
typedef struct {
  uint32_t ADCMD:1;
  uint32_t :11;
  uint32_t VREFMD:1;
  uint32_t :7;
  uint32_t HLVDMD:1;
} __PMD1bits_t;
extern volatile __PMD1bits_t PMD1bits __asm__ ("PMD1") __attribute__((section("sfrs"), address(0xBF8035C0)));
extern volatile uint32_t        PMD1CLR __attribute__((section("sfrs"),address(0xBF8035C4)));
extern volatile uint32_t        PMD1SET __attribute__((section("sfrs"),address(0xBF8035C8)));
extern volatile uint32_t        PMD1INV __attribute__((section("sfrs"),address(0xBF8035CC)));
#define PMD2 PMD2
extern volatile uint32_t   PMD2 __attribute__((section("sfrs"), address(0xBF8035D0)));
typedef struct {
  uint32_t CMP1MD:1;
  uint32_t CMP2MD:1;
  uint32_t CMP3MD:1;
  uint32_t :21;
  uint32_t CLC1MD:1;
  uint32_t CLC2MD:1;
  uint32_t CLC3MD:1;
  uint32_t CLC4MD:1;
} __PMD2bits_t;
extern volatile __PMD2bits_t PMD2bits __asm__ ("PMD2") __attribute__((section("sfrs"), address(0xBF8035D0)));
extern volatile uint32_t        PMD2CLR __attribute__((section("sfrs"),address(0xBF8035D4)));
extern volatile uint32_t        PMD2SET __attribute__((section("sfrs"),address(0xBF8035D8)));
extern volatile uint32_t        PMD2INV __attribute__((section("sfrs"),address(0xBF8035DC)));
#define PMD3 PMD3
extern volatile uint32_t   PMD3 __attribute__((section("sfrs"), address(0xBF8035E0)));
typedef struct {
  uint32_t :8;
  uint32_t CCP1MD:1;
  uint32_t CCP2MD:1;
  uint32_t CCP3MD:1;
  uint32_t CCP4MD:1;
  uint32_t CC5MD:1;
  uint32_t CC6MD:1;
  uint32_t CC7MD:1;
  uint32_t CC8MD:1;
  uint32_t CC9MD:1;
} __PMD3bits_t;
extern volatile __PMD3bits_t PMD3bits __asm__ ("PMD3") __attribute__((section("sfrs"), address(0xBF8035E0)));
extern volatile uint32_t        PMD3CLR __attribute__((section("sfrs"),address(0xBF8035E4)));
extern volatile uint32_t        PMD3SET __attribute__((section("sfrs"),address(0xBF8035E8)));
extern volatile uint32_t        PMD3INV __attribute__((section("sfrs"),address(0xBF8035EC)));
#define PMD4 PMD4
extern volatile uint32_t   PMD4 __attribute__((section("sfrs"), address(0xBF8035F0)));
typedef struct {
  uint32_t T1MD:1;
  uint32_t T2MD:1;
  uint32_t T3MD:1;
} __PMD4bits_t;
extern volatile __PMD4bits_t PMD4bits __asm__ ("PMD4") __attribute__((section("sfrs"), address(0xBF8035F0)));
extern volatile uint32_t        PMD4CLR __attribute__((section("sfrs"),address(0xBF8035F4)));
extern volatile uint32_t        PMD4SET __attribute__((section("sfrs"),address(0xBF8035F8)));
extern volatile uint32_t        PMD4INV __attribute__((section("sfrs"),address(0xBF8035FC)));
#define PMD5 PMD5
extern volatile uint32_t   PMD5 __attribute__((section("sfrs"), address(0xBF803600)));
typedef struct {
  uint32_t U1MD:1;
  uint32_t U2MD:1;
  uint32_t U3MD:1;
  uint32_t :5;
  uint32_t SPI1MD:1;
  uint32_t SPI2MD:1;
  uint32_t SPI3MD:1;
  uint32_t :5;
  uint32_t I2C1MD:1;
  uint32_t I2C2MD:1;
  uint32_t I2C3MD:1;
  uint32_t :5;
  uint32_t USBMD:1;
} __PMD5bits_t;
extern volatile __PMD5bits_t PMD5bits __asm__ ("PMD5") __attribute__((section("sfrs"), address(0xBF803600)));
extern volatile uint32_t        PMD5CLR __attribute__((section("sfrs"),address(0xBF803604)));
extern volatile uint32_t        PMD5SET __attribute__((section("sfrs"),address(0xBF803608)));
extern volatile uint32_t        PMD5INV __attribute__((section("sfrs"),address(0xBF80360C)));
#define PMD6 PMD6
extern volatile uint32_t   PMD6 __attribute__((section("sfrs"), address(0xBF803610)));
typedef struct {
  uint32_t RTCCMD:1;
  uint32_t :7;
  uint32_t REFOMD:1;
} __PMD6bits_t;
extern volatile __PMD6bits_t PMD6bits __asm__ ("PMD6") __attribute__((section("sfrs"), address(0xBF803610)));
extern volatile uint32_t        PMD6CLR __attribute__((section("sfrs"),address(0xBF803614)));
extern volatile uint32_t        PMD6SET __attribute__((section("sfrs"),address(0xBF803618)));
extern volatile uint32_t        PMD6INV __attribute__((section("sfrs"),address(0xBF80361C)));
#define PMD7 PMD7
extern volatile uint32_t   PMD7 __attribute__((section("sfrs"), address(0xBF803620)));
typedef struct {
  uint32_t :4;
  uint32_t DMAMD:1;
} __PMD7bits_t;
