Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0128gpm028.h
extern volatile __DCH1DSAbits_t DCH1DSAbits __asm__ ("DCH1DSA") __attribute__((section("sfrs"), address(0xBF808A60)));
extern volatile uint32_t        DCH1DSACLR __attribute__((section("sfrs"),address(0xBF808A64)));
extern volatile uint32_t        DCH1DSASET __attribute__((section("sfrs"),address(0xBF808A68)));
extern volatile uint32_t        DCH1DSAINV __attribute__((section("sfrs"),address(0xBF808A6C)));
#define DCH1SSIZ DCH1SSIZ
extern volatile uint32_t   DCH1SSIZ __attribute__((section("sfrs"), address(0xBF808A70)));
extern volatile uint32_t        DCH1SSIZCLR __attribute__((section("sfrs"),address(0xBF808A74)));
extern volatile uint32_t        DCH1SSIZSET __attribute__((section("sfrs"),address(0xBF808A78)));
extern volatile uint32_t        DCH1SSIZINV __attribute__((section("sfrs"),address(0xBF808A7C)));
#define DCH1DSIZ DCH1DSIZ
extern volatile uint32_t   DCH1DSIZ __attribute__((section("sfrs"), address(0xBF808A80)));
extern volatile uint32_t        DCH1DSIZCLR __attribute__((section("sfrs"),address(0xBF808A84)));
extern volatile uint32_t        DCH1DSIZSET __attribute__((section("sfrs"),address(0xBF808A88)));
extern volatile uint32_t        DCH1DSIZINV __attribute__((section("sfrs"),address(0xBF808A8C)));
#define DCH1SPTR DCH1SPTR
extern volatile uint32_t   DCH1SPTR __attribute__((section("sfrs"), address(0xBF808A90)));
extern volatile uint32_t        DCH1SPTRCLR __attribute__((section("sfrs"),address(0xBF808A94)));
extern volatile uint32_t        DCH1SPTRSET __attribute__((section("sfrs"),address(0xBF808A98)));
extern volatile uint32_t        DCH1SPTRINV __attribute__((section("sfrs"),address(0xBF808A9C)));
#define DCH1DPTR DCH1DPTR
extern volatile uint32_t   DCH1DPTR __attribute__((section("sfrs"), address(0xBF808AA0)));
extern volatile uint32_t        DCH1DPTRCLR __attribute__((section("sfrs"),address(0xBF808AA4)));
extern volatile uint32_t        DCH1DPTRSET __attribute__((section("sfrs"),address(0xBF808AA8)));
extern volatile uint32_t        DCH1DPTRINV __attribute__((section("sfrs"),address(0xBF808AAC)));
#define DCH1CSIZ DCH1CSIZ
extern volatile uint32_t   DCH1CSIZ __attribute__((section("sfrs"), address(0xBF808AB0)));
extern volatile uint32_t        DCH1CSIZCLR __attribute__((section("sfrs"),address(0xBF808AB4)));
extern volatile uint32_t        DCH1CSIZSET __attribute__((section("sfrs"),address(0xBF808AB8)));
extern volatile uint32_t        DCH1CSIZINV __attribute__((section("sfrs"),address(0xBF808ABC)));
#define DCH1CPTR DCH1CPTR
extern volatile uint32_t   DCH1CPTR __attribute__((section("sfrs"), address(0xBF808AC0)));
extern volatile uint32_t        DCH1CPTRCLR __attribute__((section("sfrs"),address(0xBF808AC4)));
extern volatile uint32_t        DCH1CPTRSET __attribute__((section("sfrs"),address(0xBF808AC8)));
extern volatile uint32_t        DCH1CPTRINV __attribute__((section("sfrs"),address(0xBF808ACC)));
#define DCH1DAT DCH1DAT
extern volatile uint32_t   DCH1DAT __attribute__((section("sfrs"), address(0xBF808AD0)));
extern volatile uint32_t        DCH1DATCLR __attribute__((section("sfrs"),address(0xBF808AD4)));
extern volatile uint32_t        DCH1DATSET __attribute__((section("sfrs"),address(0xBF808AD8)));
extern volatile uint32_t        DCH1DATINV __attribute__((section("sfrs"),address(0xBF808ADC)));
#define DCH2CON DCH2CON
extern volatile uint32_t   DCH2CON __attribute__((section("sfrs"), address(0xBF808AE0)));
typedef union {
  struct {
    uint32_t CHPRI:2;
    uint32_t CHEDET:1;
    uint32_t :1;
    uint32_t CHAEN:1;
    uint32_t CHCHN:1;
    uint32_t CHAED:1;
    uint32_t CHEN:1;
    uint32_t CHCHNS:1;
    uint32_t :6;
    uint32_t CHBUSY:1;
  };
  struct {
    uint32_t w:32;
  };
} __DCH2CONbits_t;
extern volatile __DCH2CONbits_t DCH2CONbits __asm__ ("DCH2CON") __attribute__((section("sfrs"), address(0xBF808AE0)));
extern volatile uint32_t        DCH2CONCLR __attribute__((section("sfrs"),address(0xBF808AE4)));
extern volatile uint32_t        DCH2CONSET __attribute__((section("sfrs"),address(0xBF808AE8)));
extern volatile uint32_t        DCH2CONINV __attribute__((section("sfrs"),address(0xBF808AEC)));
#define DCH2ECON DCH2ECON
extern volatile uint32_t   DCH2ECON __attribute__((section("sfrs"), address(0xBF808AF0)));
typedef union {
  struct {
    uint32_t :3;
    uint32_t AIRQEN:1;
    uint32_t SIRQEN:1;
    uint32_t PATEN:1;
    uint32_t CABORT:1;
    uint32_t CFORCE:1;
    uint32_t CHSIRQ:8;
    uint32_t CHAIRQ:8;
  };
  struct {
    uint32_t w:32;
  };
} __DCH2ECONbits_t;
extern volatile __DCH2ECONbits_t DCH2ECONbits __asm__ ("DCH2ECON") __attribute__((section("sfrs"), address(0xBF808AF0)));
extern volatile uint32_t        DCH2ECONCLR __attribute__((section("sfrs"),address(0xBF808AF4)));
extern volatile uint32_t        DCH2ECONSET __attribute__((section("sfrs"),address(0xBF808AF8)));
extern volatile uint32_t        DCH2ECONINV __attribute__((section("sfrs"),address(0xBF808AFC)));
#define DCH2INT DCH2INT
extern volatile uint32_t   DCH2INT __attribute__((section("sfrs"), address(0xBF808B00)));
typedef union {
  struct {
    uint32_t CHERIF:1;
    uint32_t CHTAIF:1;
    uint32_t CHCCIF:1;
    uint32_t CHBCIF:1;
    uint32_t CHDHIF:1;
    uint32_t CHDDIF:1;
    uint32_t CHSHIF:1;
    uint32_t CHSDIF:1;
    uint32_t :8;
    uint32_t CHERIE:1;
    uint32_t CHTAIE:1;
    uint32_t CHCCIE:1;
    uint32_t CHBCIE:1;
    uint32_t CHDHIE:1;
    uint32_t CHDDIE:1;
    uint32_t CHSHIE:1;
    uint32_t CHSDIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __DCH2INTbits_t;
extern volatile __DCH2INTbits_t DCH2INTbits __asm__ ("DCH2INT") __attribute__((section("sfrs"), address(0xBF808B00)));
extern volatile uint32_t        DCH2INTCLR __attribute__((section("sfrs"),address(0xBF808B04)));
extern volatile uint32_t        DCH2INTSET __attribute__((section("sfrs"),address(0xBF808B08)));
extern volatile uint32_t        DCH2INTINV __attribute__((section("sfrs"),address(0xBF808B0C)));
#define DCH2SSA DCH2SSA
extern volatile uint32_t   DCH2SSA __attribute__((section("sfrs"), address(0xBF808B10)));
typedef struct {
  uint32_t CHSSA:32;
} __DCH2SSAbits_t;
