Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0128gpm028.h
extern volatile __INTCONbits_t INTCONbits __asm__ ("INTCON") __attribute__((section("sfrs"), address(0xBF80F000)));
extern volatile uint32_t        INTCONCLR __attribute__((section("sfrs"),address(0xBF80F004)));
extern volatile uint32_t        INTCONSET __attribute__((section("sfrs"),address(0xBF80F008)));
extern volatile uint32_t        INTCONINV __attribute__((section("sfrs"),address(0xBF80F00C)));
#define PRISS PRISS
extern volatile uint32_t   PRISS __attribute__((section("sfrs"), address(0xBF80F010)));
typedef struct {
  uint32_t SEVCSS:1;
  uint32_t :3;
  uint32_t PRI1SS:1;
  uint32_t :3;
  uint32_t PRI2SS:1;
  uint32_t :3;
  uint32_t PRI3SS:1;
  uint32_t :3;
  uint32_t PRI4SS:1;
  uint32_t :3;
  uint32_t PRI5SS:1;
  uint32_t :3;
  uint32_t PRI6SS:1;
  uint32_t :3;
  uint32_t PRI7SS:1;
} __PRISSbits_t;
extern volatile __PRISSbits_t PRISSbits __asm__ ("PRISS") __attribute__((section("sfrs"), address(0xBF80F010)));
extern volatile uint32_t        PRISSCLR __attribute__((section("sfrs"),address(0xBF80F014)));
extern volatile uint32_t        PRISSSET __attribute__((section("sfrs"),address(0xBF80F018)));
extern volatile uint32_t        PRISSINV __attribute__((section("sfrs"),address(0xBF80F01C)));
#define INTSTAT INTSTAT
extern volatile uint32_t   INTSTAT __attribute__((section("sfrs"), address(0xBF80F020)));
typedef struct {
  uint32_t SIRQ:8;
  uint32_t SRIPL:3;
} __INTSTATbits_t;
extern volatile __INTSTATbits_t INTSTATbits __asm__ ("INTSTAT") __attribute__((section("sfrs"), address(0xBF80F020)));
extern volatile uint32_t        INTSTATCLR __attribute__((section("sfrs"),address(0xBF80F024)));
extern volatile uint32_t        INTSTATSET __attribute__((section("sfrs"),address(0xBF80F028)));
extern volatile uint32_t        INTSTATINV __attribute__((section("sfrs"),address(0xBF80F02C)));
#define IPTMR IPTMR
extern volatile uint32_t   IPTMR __attribute__((section("sfrs"), address(0xBF80F030)));
typedef struct {
  uint32_t IPTMR:32;
} __IPTMRbits_t;
extern volatile __IPTMRbits_t IPTMRbits __asm__ ("IPTMR") __attribute__((section("sfrs"), address(0xBF80F030)));
extern volatile uint32_t        IPTMRCLR __attribute__((section("sfrs"),address(0xBF80F034)));
extern volatile uint32_t        IPTMRSET __attribute__((section("sfrs"),address(0xBF80F038)));
extern volatile uint32_t        IPTMRINV __attribute__((section("sfrs"),address(0xBF80F03C)));
#define IFS0 IFS0
extern volatile uint32_t   IFS0 __attribute__((section("sfrs"), address(0xBF80F040)));
typedef struct {
  uint32_t CTIF:1;
  uint32_t CS0IF:1;
  uint32_t CS1IF:1;
  uint32_t INT0IF:1;
  uint32_t INT1IF:1;
  uint32_t INT2IF:1;
  uint32_t INT3IF:1;
  uint32_t INT4IF:1;
  uint32_t CNAIF:1;
  uint32_t CNBIF:1;
  uint32_t CNCIF:1;
  uint32_t CNDIF:1;
  uint32_t :5;
  uint32_t T1IF:1;
  uint32_t T2IF:1;
  uint32_t T3IF:1;
  uint32_t :3;
  uint32_t CMP1IF:1;
  uint32_t CMP2IF:1;
  uint32_t CMP3IF:1;
  uint32_t :3;
  uint32_t USBIF:1;
} __IFS0bits_t;
extern volatile __IFS0bits_t IFS0bits __asm__ ("IFS0") __attribute__((section("sfrs"), address(0xBF80F040)));
extern volatile uint32_t        IFS0CLR __attribute__((section("sfrs"),address(0xBF80F044)));
extern volatile uint32_t        IFS0SET __attribute__((section("sfrs"),address(0xBF80F048)));
extern volatile uint32_t        IFS0INV __attribute__((section("sfrs"),address(0xBF80F04C)));
#define IFS1 IFS1
extern volatile uint32_t   IFS1 __attribute__((section("sfrs"), address(0xBF80F050)));
typedef struct {
  uint32_t RTCCIF:1;
  uint32_t AD1IF:1;
  uint32_t :2;
  uint32_t LVDIF:1;
  uint32_t CLC1IF:1;
  uint32_t CLC2IF:1;
  uint32_t CLC3IF:1;
  uint32_t CLC4IF:1;
  uint32_t SPI1EIF:1;
  uint32_t SPI1TXIF:1;
  uint32_t SPI1RXIF:1;
  uint32_t SPI2EIF:1;
  uint32_t SPI2TXIF:1;
  uint32_t SPI2RXIF:1;
  uint32_t SPI3EIF:1;
  uint32_t SPI3TXIF:1;
  uint32_t SPI3RXIF:1;
  uint32_t :3;
  uint32_t U1RXIF:1;
  uint32_t U1TXIF:1;
  uint32_t U1EIF:1;
  uint32_t U2RXIF:1;
  uint32_t U2TXIF:1;
  uint32_t U2EIF:1;
  uint32_t U3RXIF:1;
  uint32_t U3TXIF:1;
  uint32_t U3EIF:1;
} __IFS1bits_t;
extern volatile __IFS1bits_t IFS1bits __asm__ ("IFS1") __attribute__((section("sfrs"), address(0xBF80F050)));
extern volatile uint32_t        IFS1CLR __attribute__((section("sfrs"),address(0xBF80F054)));
extern volatile uint32_t        IFS1SET __attribute__((section("sfrs"),address(0xBF80F058)));
extern volatile uint32_t        IFS1INV __attribute__((section("sfrs"),address(0xBF80F05C)));
#define IFS2 IFS2
extern volatile uint32_t   IFS2 __attribute__((section("sfrs"), address(0xBF80F060)));
typedef struct {
  uint32_t :1;
  uint32_t I2C1SIF:1;
  uint32_t I2C1MIF:1;
  uint32_t I2C1BCIF:1;
  uint32_t I2C2SIF:1;
  uint32_t I2C2MIF:1;
  uint32_t I2C2BCIF:1;
  uint32_t I2C3SIF:1;
  uint32_t I2C3MIF:1;
  uint32_t I2C3BCIF:1;
  uint32_t CCP1IF:1;
  uint32_t CCT1IF:1;
  uint32_t CCP2IF:1;
  uint32_t CCT2IF:1;
  uint32_t CCP3IF:1;
  uint32_t CCT3IF:1;
  uint32_t CCP4IF:1;
  uint32_t CCT4IF:1;
  uint32_t CCP5IF:1;
  uint32_t CCT5IF:1;
  uint32_t CCP6IF:1;
  uint32_t CCT6IF:1;
  uint32_t CCP7IF:1;
  uint32_t CCT7IF:1;
  uint32_t CCP8IF:1;
  uint32_t CCT8IF:1;
  uint32_t CCP9IF:1;
  uint32_t CCT9IF:1;
  uint32_t FSTIF:1;
  uint32_t :1;
  uint32_t NVMIF:1;
  uint32_t CPCIF:1;
} __IFS2bits_t;
extern volatile __IFS2bits_t IFS2bits __asm__ ("IFS2") __attribute__((section("sfrs"), address(0xBF80F060)));
extern volatile uint32_t        IFS2CLR __attribute__((section("sfrs"),address(0xBF80F064)));
extern volatile uint32_t        IFS2SET __attribute__((section("sfrs"),address(0xBF80F068)));
extern volatile uint32_t        IFS2INV __attribute__((section("sfrs"),address(0xBF80F06C)));
#define IFS3 IFS3
extern volatile uint32_t   IFS3 __attribute__((section("sfrs"), address(0xBF80F070)));
typedef struct {
  uint32_t :1;
  uint32_t ECCBEIF:1;
  uint32_t DMA0IF:1;
  uint32_t DMA1IF:1;
  uint32_t DMA2IF:1;
  uint32_t DMA3IF:1;
} __IFS3bits_t;
extern volatile __IFS3bits_t IFS3bits __asm__ ("IFS3") __attribute__((section("sfrs"), address(0xBF80F070)));
extern volatile uint32_t        IFS3CLR __attribute__((section("sfrs"),address(0xBF80F074)));
extern volatile uint32_t        IFS3SET __attribute__((section("sfrs"),address(0xBF80F078)));
extern volatile uint32_t        IFS3INV __attribute__((section("sfrs"),address(0xBF80F07C)));
#define IEC0 IEC0
extern volatile uint32_t   IEC0 __attribute__((section("sfrs"), address(0xBF80F0C0)));
typedef struct {
  uint32_t CTIE:1;
  uint32_t CS0IE:1;
  uint32_t CS1IE:1;
  uint32_t INT0IE:1;
  uint32_t INT1IE:1;
  uint32_t INT2IE:1;
  uint32_t INT3IE:1;
  uint32_t INT4IE:1;
  uint32_t CNAIE:1;
  uint32_t CNBIE:1;
  uint32_t CNCIE:1;
  uint32_t CNDIE:1;
  uint32_t :5;
  uint32_t T1IE:1;
  uint32_t T2IE:1;
  uint32_t T3IE:1;
  uint32_t :3;
  uint32_t CMP1IE:1;
  uint32_t CMP2IE:1;
  uint32_t CMP3IE:1;
  uint32_t :3;
  uint32_t USBIE:1;
} __IEC0bits_t;
extern volatile __IEC0bits_t IEC0bits __asm__ ("IEC0") __attribute__((section("sfrs"), address(0xBF80F0C0)));
extern volatile uint32_t        IEC0CLR __attribute__((section("sfrs"),address(0xBF80F0C4)));
extern volatile uint32_t        IEC0SET __attribute__((section("sfrs"),address(0xBF80F0C8)));
extern volatile uint32_t        IEC0INV __attribute__((section("sfrs"),address(0xBF80F0CC)));
#define IEC1 IEC1
extern volatile uint32_t   IEC1 __attribute__((section("sfrs"), address(0xBF80F0D0)));
typedef struct {
  uint32_t RTCCIE:1;
  uint32_t AD1IE:1;
  uint32_t :2;
  uint32_t LVDIE:1;
  uint32_t CLC1IE:1;
  uint32_t CLC2IE:1;
  uint32_t CLC3IE:1;
  uint32_t CLC4IE:1;
  uint32_t SPI1EIE:1;
  uint32_t SPI1TXIE:1;
  uint32_t SPI1RXIE:1;
  uint32_t SPI2EIE:1;
  uint32_t SPI2TXIE:1;
  uint32_t SPI2RXIE:1;
  uint32_t SPI3EIE:1;
  uint32_t SPI3TXIE:1;
  uint32_t SPI3RXIE:1;
  uint32_t :3;
  uint32_t U1RXIE:1;
  uint32_t U1TXIE:1;
  uint32_t U1EIE:1;
  uint32_t U2RXIE:1;
  uint32_t U2TXIE:1;
  uint32_t U2EIE:1;
  uint32_t U3RXIE:1;
  uint32_t U3TXIE:1;
  uint32_t U3EIE:1;
} __IEC1bits_t;
extern volatile __IEC1bits_t IEC1bits __asm__ ("IEC1") __attribute__((section("sfrs"), address(0xBF80F0D0)));
extern volatile uint32_t        IEC1CLR __attribute__((section("sfrs"),address(0xBF80F0D4)));
extern volatile uint32_t        IEC1SET __attribute__((section("sfrs"),address(0xBF80F0D8)));
extern volatile uint32_t        IEC1INV __attribute__((section("sfrs"),address(0xBF80F0DC)));
#define IEC2 IEC2
extern volatile uint32_t   IEC2 __attribute__((section("sfrs"), address(0xBF80F0E0)));
typedef struct {
  uint32_t :1;
  uint32_t I2C1SIE:1;
  uint32_t I2C1MIE:1;
  uint32_t I2C1BCIE:1;
  uint32_t I2C2SIE:1;
  uint32_t I2C2MIE:1;
  uint32_t I2C2BCIE:1;
  uint32_t I2C3SIE:1;
  uint32_t I2C3MIE:1;
  uint32_t I2C3BCIE:1;
  uint32_t CCP1IE:1;
  uint32_t CCT1IE:1;
  uint32_t CCP2IE:1;
  uint32_t CCT2IE:1;
  uint32_t CCP3IE:1;
  uint32_t CCT3IE:1;
  uint32_t CCP4IE:1;
  uint32_t CCT4IE:1;
  uint32_t CCP5IE:1;
  uint32_t CCT5IE:1;
  uint32_t CCP6IE:1;
  uint32_t CCT6IE:1;
  uint32_t CCP7IE:1;
  uint32_t CCT7IE:1;
  uint32_t CCP8IE:1;
  uint32_t CCT8IE:1;
  uint32_t CCP9IE:1;
  uint32_t CCT9IE:1;
  uint32_t FSTIE:1;
  uint32_t :1;
  uint32_t NVMIE:1;
  uint32_t CPCIE:1;
} __IEC2bits_t;
extern volatile __IEC2bits_t IEC2bits __asm__ ("IEC2") __attribute__((section("sfrs"), address(0xBF80F0E0)));
extern volatile uint32_t        IEC2CLR __attribute__((section("sfrs"),address(0xBF80F0E4)));
extern volatile uint32_t        IEC2SET __attribute__((section("sfrs"),address(0xBF80F0E8)));
extern volatile uint32_t        IEC2INV __attribute__((section("sfrs"),address(0xBF80F0EC)));
#define IEC3 IEC3
extern volatile uint32_t   IEC3 __attribute__((section("sfrs"), address(0xBF80F0F0)));
typedef struct {
  uint32_t :1;
  uint32_t ECCBEIE:1;
  uint32_t DMA0IE:1;
  uint32_t DMA1IE:1;
  uint32_t DMA2IE:1;
  uint32_t DMA3IE:1;
} __IEC3bits_t;
extern volatile __IEC3bits_t IEC3bits __asm__ ("IEC3") __attribute__((section("sfrs"), address(0xBF80F0F0)));
extern volatile uint32_t        IEC3CLR __attribute__((section("sfrs"),address(0xBF80F0F4)));
extern volatile uint32_t        IEC3SET __attribute__((section("sfrs"),address(0xBF80F0F8)));
extern volatile uint32_t        IEC3INV __attribute__((section("sfrs"),address(0xBF80F0FC)));
#define IPC0 IPC0
extern volatile uint32_t   IPC0 __attribute__((section("sfrs"), address(0xBF80F140)));
typedef struct {
  uint32_t CTIS:2;
  uint32_t CTIP:3;
  uint32_t :3;
  uint32_t CS0IS:2;
  uint32_t CS0IP:3;
  uint32_t :3;
  uint32_t CS1IS:2;
  uint32_t CS1IP:3;
  uint32_t :3;
  uint32_t INT0IS:2;
  uint32_t INT0IP:3;
} __IPC0bits_t;
extern volatile __IPC0bits_t IPC0bits __asm__ ("IPC0") __attribute__((section("sfrs"), address(0xBF80F140)));
extern volatile uint32_t        IPC0CLR __attribute__((section("sfrs"),address(0xBF80F144)));
extern volatile uint32_t        IPC0SET __attribute__((section("sfrs"),address(0xBF80F148)));
extern volatile uint32_t        IPC0INV __attribute__((section("sfrs"),address(0xBF80F14C)));
#define IPC1 IPC1
extern volatile uint32_t   IPC1 __attribute__((section("sfrs"), address(0xBF80F150)));
typedef struct {
  uint32_t INT1IS:2;
  uint32_t INT1IP:3;
  uint32_t :3;
  uint32_t INT2IS:2;
  uint32_t INT2IP:3;
  uint32_t :3;
  uint32_t INT3IS:2;
  uint32_t INT3IP:3;
  uint32_t :3;
  uint32_t INT4IS:2;
  uint32_t INT4IP:3;
} __IPC1bits_t;
