Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0128gpm028.h
#define _IPC10_CLC4IP_POSITION                   0x00000002
#define _IPC10_CLC4IP_MASK                       0x0000001C
#define _IPC10_CLC4IP_LENGTH                     0x00000003

#define _IPC10_SPI1EIS_POSITION                  0x00000008
#define _IPC10_SPI1EIS_MASK                      0x00000300
#define _IPC10_SPI1EIS_LENGTH                    0x00000002

#define _IPC10_SPI1EIP_POSITION                  0x0000000A
#define _IPC10_SPI1EIP_MASK                      0x00001C00
#define _IPC10_SPI1EIP_LENGTH                    0x00000003

#define _IPC10_SPI1TXIS_POSITION                 0x00000010
#define _IPC10_SPI1TXIS_MASK                     0x00030000
#define _IPC10_SPI1TXIS_LENGTH                   0x00000002

#define _IPC10_SPI1TXIP_POSITION                 0x00000012
#define _IPC10_SPI1TXIP_MASK                     0x001C0000
#define _IPC10_SPI1TXIP_LENGTH                   0x00000003

#define _IPC10_SPI1RXIS_POSITION                 0x00000018
#define _IPC10_SPI1RXIS_MASK                     0x03000000
#define _IPC10_SPI1RXIS_LENGTH                   0x00000002

#define _IPC10_SPI1RXIP_POSITION                 0x0000001A
#define _IPC10_SPI1RXIP_MASK                     0x1C000000
#define _IPC10_SPI1RXIP_LENGTH                   0x00000003

#define _IPC11_SPI2EIS_POSITION                  0x00000000
#define _IPC11_SPI2EIS_MASK                      0x00000003
#define _IPC11_SPI2EIS_LENGTH                    0x00000002

#define _IPC11_SPI2EIP_POSITION                  0x00000002
#define _IPC11_SPI2EIP_MASK                      0x0000001C
#define _IPC11_SPI2EIP_LENGTH                    0x00000003

#define _IPC11_SPI2TXIS_POSITION                 0x00000008
#define _IPC11_SPI2TXIS_MASK                     0x00000300
#define _IPC11_SPI2TXIS_LENGTH                   0x00000002

#define _IPC11_SPI2TXIP_POSITION                 0x0000000A
#define _IPC11_SPI2TXIP_MASK                     0x00001C00
#define _IPC11_SPI2TXIP_LENGTH                   0x00000003

#define _IPC11_SPI2RXIS_POSITION                 0x00000010
#define _IPC11_SPI2RXIS_MASK                     0x00030000
#define _IPC11_SPI2RXIS_LENGTH                   0x00000002

#define _IPC11_SPI2RXIP_POSITION                 0x00000012
#define _IPC11_SPI2RXIP_MASK                     0x001C0000
#define _IPC11_SPI2RXIP_LENGTH                   0x00000003

#define _IPC11_SPI3EIS_POSITION                  0x00000018
#define _IPC11_SPI3EIS_MASK                      0x03000000
#define _IPC11_SPI3EIS_LENGTH                    0x00000002

#define _IPC11_SPI3EIP_POSITION                  0x0000001A
#define _IPC11_SPI3EIP_MASK                      0x1C000000
#define _IPC11_SPI3EIP_LENGTH                    0x00000003

#define _IPC12_SPI3TXIS_POSITION                 0x00000000
#define _IPC12_SPI3TXIS_MASK                     0x00000003
#define _IPC12_SPI3TXIS_LENGTH                   0x00000002

#define _IPC12_SPI3TXIP_POSITION                 0x00000002
#define _IPC12_SPI3TXIP_MASK                     0x0000001C
#define _IPC12_SPI3TXIP_LENGTH                   0x00000003

#define _IPC12_SPI3RXIS_POSITION                 0x00000008
#define _IPC12_SPI3RXIS_MASK                     0x00000300
#define _IPC12_SPI3RXIS_LENGTH                   0x00000002

#define _IPC12_SPI3RXIP_POSITION                 0x0000000A
#define _IPC12_SPI3RXIP_MASK                     0x00001C00
#define _IPC12_SPI3RXIP_LENGTH                   0x00000003

#define _IPC13_U1RXIS_POSITION                   0x00000008
#define _IPC13_U1RXIS_MASK                       0x00000300
#define _IPC13_U1RXIS_LENGTH                     0x00000002

#define _IPC13_U1RXIP_POSITION                   0x0000000A
#define _IPC13_U1RXIP_MASK                       0x00001C00
#define _IPC13_U1RXIP_LENGTH                     0x00000003

#define _IPC13_U1TXIS_POSITION                   0x00000010
#define _IPC13_U1TXIS_MASK                       0x00030000
#define _IPC13_U1TXIS_LENGTH                     0x00000002

#define _IPC13_U1TXIP_POSITION                   0x00000012
#define _IPC13_U1TXIP_MASK                       0x001C0000
#define _IPC13_U1TXIP_LENGTH                     0x00000003

#define _IPC13_U1EIS_POSITION                    0x00000018
#define _IPC13_U1EIS_MASK                        0x03000000
#define _IPC13_U1EIS_LENGTH                      0x00000002

#define _IPC13_U1EIP_POSITION                    0x0000001A
#define _IPC13_U1EIP_MASK                        0x1C000000
#define _IPC13_U1EIP_LENGTH                      0x00000003

#define _IPC14_U2RXIS_POSITION                   0x00000000
#define _IPC14_U2RXIS_MASK                       0x00000003
#define _IPC14_U2RXIS_LENGTH                     0x00000002

#define _IPC14_U2RXIP_POSITION                   0x00000002
#define _IPC14_U2RXIP_MASK                       0x0000001C
#define _IPC14_U2RXIP_LENGTH                     0x00000003

#define _IPC14_U2TXIS_POSITION                   0x00000008
#define _IPC14_U2TXIS_MASK                       0x00000300
#define _IPC14_U2TXIS_LENGTH                     0x00000002

#define _IPC14_U2TXIP_POSITION                   0x0000000A
#define _IPC14_U2TXIP_MASK                       0x00001C00
#define _IPC14_U2TXIP_LENGTH                     0x00000003

#define _IPC14_U2EIS_POSITION                    0x00000010
#define _IPC14_U2EIS_MASK                        0x00030000
#define _IPC14_U2EIS_LENGTH                      0x00000002

#define _IPC14_U2EIP_POSITION                    0x00000012
#define _IPC14_U2EIP_MASK                        0x001C0000
#define _IPC14_U2EIP_LENGTH                      0x00000003

#define _IPC14_U3RXIS_POSITION                   0x00000018
#define _IPC14_U3RXIS_MASK                       0x03000000
#define _IPC14_U3RXIS_LENGTH                     0x00000002

#define _IPC14_U3RXIP_POSITION                   0x0000001A
#define _IPC14_U3RXIP_MASK                       0x1C000000
#define _IPC14_U3RXIP_LENGTH                     0x00000003

#define _IPC15_U3TXIS_POSITION                   0x00000000
#define _IPC15_U3TXIS_MASK                       0x00000003
#define _IPC15_U3TXIS_LENGTH                     0x00000002

#define _IPC15_U3TXIP_POSITION                   0x00000002
#define _IPC15_U3TXIP_MASK                       0x0000001C
#define _IPC15_U3TXIP_LENGTH                     0x00000003

#define _IPC15_U3EIS_POSITION                    0x00000008
#define _IPC15_U3EIS_MASK                        0x00000300
#define _IPC15_U3EIS_LENGTH                      0x00000002

#define _IPC15_U3EIP_POSITION                    0x0000000A
#define _IPC15_U3EIP_MASK                        0x00001C00
#define _IPC15_U3EIP_LENGTH                      0x00000003

